## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_security_group.app_subnet_nsg will be created
  + resource "azurerm_network_security_group" "app_subnet_nsg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "sap-dev-vnet-default-appsubnet-nsg"
      + resource_group_name = (known after apply)
      + security_rule       = (known after apply)
    }

  # azurerm_network_security_group.web_subnet_nsg will be created
  + resource "azurerm_network_security_group" "web_subnet_nsg" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "sap-dev-vnet-default-websubnet-nsg"
      + resource_group_name = (known after apply)
      + security_rule       = (known after apply)
    }

  # azurerm_network_security_rule.app_nsg_rule_inbound["100"] will be created
  + resource "azurerm_network_security_rule" "app_nsg_rule_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Rule-Port-80"
      + network_security_group_name = "sap-dev-vnet-default-appsubnet-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = (known after apply)
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.app_nsg_rule_inbound["110"] will be created
  + resource "azurerm_network_security_rule" "app_nsg_rule_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Rule-Port-443"
      + network_security_group_name = "sap-dev-vnet-default-appsubnet-nsg"
      + priority                    = 110
      + protocol                    = "Tcp"
      + resource_group_name         = (known after apply)
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.app_nsg_rule_inbound["120"] will be created
  + resource "azurerm_network_security_rule" "app_nsg_rule_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "8080"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Rule-Port-8080"
      + network_security_group_name = "sap-dev-vnet-default-appsubnet-nsg"
      + priority                    = 120
      + protocol                    = "Tcp"
      + resource_group_name         = (known after apply)
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.app_nsg_rule_inbound["130"] will be created
  + resource "azurerm_network_security_rule" "app_nsg_rule_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Rule-Port-22"
      + network_security_group_name = "sap-dev-vnet-default-appsubnet-nsg"
      + priority                    = 130
      + protocol                    = "Tcp"
      + resource_group_name         = (known after apply)
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.web_nsg_rule_inbound["100"] will be created
  + resource "azurerm_network_security_rule" "web_nsg_rule_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Rule-Port-80"
      + network_security_group_name = "sap-dev-vnet-default-websubnet-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = (known after apply)
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.web_nsg_rule_inbound["110"] will be created
  + resource "azurerm_network_security_rule" "web_nsg_rule_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Rule-Port-443"
      + network_security_group_name = "sap-dev-vnet-default-websubnet-nsg"
      + priority                    = 110
      + protocol                    = "Tcp"
      + resource_group_name         = (known after apply)
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.web_nsg_rule_inbound["120"] will be created
  + resource "azurerm_network_security_rule" "web_nsg_rule_inbound" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "Rule-Port-22"
      + network_security_group_name = "sap-dev-vnet-default-websubnet-nsg"
      + priority                    = 120
      + protocol                    = "Tcp"
      + resource_group_name         = (known after apply)
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = (known after apply)
      + tags     = {
          + "environment" = "dev"
          + "owners"      = "sap"
        }
    }

  # azurerm_subnet.appsubnet will be created
  + resource "azurerm_subnet" "appsubnet" {
      + address_prefixes                              = [
          + "10.0.11.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "sap-dev-vnet-default-appsubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = (known after apply)
      + virtual_network_name                          = "sap-dev-vnet-default"
    }

  # azurerm_subnet.websubnet will be created
  + resource "azurerm_subnet" "websubnet" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "sap-dev-vnet-default-websubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = (known after apply)
      + virtual_network_name                          = "sap-dev-vnet-default"
    }

  # azurerm_subnet_network_security_group_association.app_subnet_nsg_associate will be created
  + resource "azurerm_subnet_network_security_group_association" "app_subnet_nsg_associate" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.web_subnet_nsg_associate will be created
  + resource "azurerm_subnet_network_security_group_association" "web_subnet_nsg_associate" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "sap-dev-vnet-default"
      + resource_group_name = (known after apply)
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "dev"
          + "owners"      = "sap"
        }
    }

  # random_string.myrandom will be created
  + resource "random_string" "myrandom" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - resource_group_name  = "test" -> null
  + virtual_network_id   = (known after apply)
  + virtual_network_name = "sap-dev-vnet-default"
  + web_subnet_id        = (known after apply)
  + web_subnet_name      = "sap-dev-vnet-default-websubnet"
  + web_subnet_nsg_id    = (known after apply)
  + web_subnet_nsg_name  = "sap-dev-vnet-default-websubnet-nsg"
```
</details>